* peerscp

this is a simple, command line utility for sharing files with your friends

just pass it a file over the command line, and it will pass back a magnet link, and seed the file

** installation

to install the dependencies, just

#+BEGIN_SRC shell
npm install
#+END_SRC

** API
=peerscp [folder]=

you'll get back a magnet link to share with your friends

the file should be seeding

** DONE implementation
*** DONE setup 
**** DONE paths to torrent binary
the [[https://www.npmjs.com/package/torrent][torrent]] cli client will be available in =node_modules/bin= after we =npm install=

#+name: torrent-bin
#+BEGIN_SRC shell
echo "./node_modules/.bin/torrent"
#+END_SRC
**** DONE make a folder with some test files
make a dir =xyz= here, with files =a.txt= and =b.txt=

#+BEGIN_SRC shell
mkdir xyz; echo beep > xyz/a.txt; echo boop > xyz/b.txt
#+END_SRC
*** DONE a script to get the magnet link from a torrent file
#+BEGIN_SRC js :tangle generate-magnet.js
var parse = require('parse-torrent'),
    concat = require('concat-stream')

function makeMagnetURI (f) {
  var t = parse(f)
  console.log(parse.toMagnetURI(t))
}

function handleError (err) {
  console.log(err)
  process.exit(1)
}

process.stdin.pipe(concat(makeMagnetURI))

process.stdin.on('error', handleError)
#+END_SRC

now, we should be able to get a magnet, by piping a file in

#+BEGIN_SRC shell :var TORRENT_BIN=torrent-bin

echo `node generate-magnet.js < out.torrent`

#+END_SRC

#+RESULTS:
: magnet:?xt=urn:btih:0227c9e3d50afbc10056380b6ffad2d5b6a7f24a&dn=xyz&tr=udp%3A%2F%2Fexodus.desync.com%3A6969&tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&tr=udp%3A%2F%2Ftracker.internetwarriors.net%3A1337&tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&tr=wss%3A%2F%2Ftracker.btorrent.xyz&tr=wss%3A%2F%2Ftracker.webtorrent.io

*** DONE now its a simple bash script
#+BEGIN_SRC shell :var TORRENT_BIN=torrent-bin :tangle peerscp.sh
$TORRENT_BIN create xyz > out.torrent
echo `node generate-magnet.js < out.torrent`
$TORRENT_BIN seed out.torrent
#+END_SRC

that still doesn't work!

in fact, this doesnt even work when i generate a torrent file, seed it in =torrent=, and add it to transmission!!

something's not right...
* TODO possible improvements
** TODO looks like no CLI torrent clients are working for me
** TODO could wrap this in something that handles files (rather than folders)
*** would take an arbitrary number of files as input (scp syntax)
*** and create a folder containing each one 
**** (or, if input is just 1 folder, we are done)
** TODO could ENCRYPT files too
*** though not clear how
** TODO could allow a WHITELIST
*** if you want a robust blacklist, use a regular torrent client
*** if you want to send stuff to ONE PERSON, use this.....
** TODO could HANG UP after all whitelist ppl got it
*** AND delete the torrent file
*** so no one can seed it again...
**** or at least so it seems like no one can seed it again
